imports

In [27]:
import pandas as pd

creating the dataset

In [28]:
data = {'Name': ["Simson", "Anna", "Peter", "Linda", "Maria", "Daniel", "Simon", "Monica"],
        'Profession':["Data Analyst", "Steward", "Refree", "Mechanic", "Pilot", "Nurse", "Police officer", "Doctor"],
        'Age':[28, 25, 35, 32, 55, 42, 59, 40],
        'Country':["Namibia", "South Africa", "USA", "Canada", "Nigeria", "Germany", "Germany", "Portugal"]}

df = pd.DataFrame(data)

saving the data into a csv file

In [29]:
df.to_csv("Professions.csv", index=False)

reading the csv file

In [30]:
pd.read_csv('Professions.csv')

     Name      Profession  Age       Country
0  Simson    Data Analyst   28       Namibia
1    Anna         Steward   25  South Africa
2   Peter          Refree   35           USA
3   Linda        Mechanic   32        Canada
4   Maria           Pilot   55       Nigeria
5  Daniel           Nurse   42       Germany
6   Simon  Police officer   59       Germany
7  Monica          Doctor   40      Portugal

Going through our data

In [31]:
df.describe() # Describe our dataset, Generates descriptive statistics  of the dataset

             Age
count   8.000000
mean   39.500000
std    12.224098
min    25.000000
25%    31.000000
50%    37.500000
75%    45.250000
max    59.000000

In [34]:
# Describing specific coloumns
df["Age"].mean()
df["Age"].count()
df["Age"].std()
df["Age"].max()
df["Age"].var()
df["Age"].mode()
df["Age"].min()

np.int64(25)

Getting the IQR calculations

In [36]:
df["Age"].min(), df["Age"].max()
abs(df["Age"].min()-df["Age"].max())

df["Age"].quantile(q=0.25),df["Age"].quantile(q=0.75)

(np.float64(31.0), np.float64(45.25))

using the abstraction to get IQR calculatio

In [37]:
abs(df["Age"].quantile(q=0.25)-df["Age"].quantile(q=0.75))

np.float64(14.25)

Handling missing data